## Part - 1

In [1]:
import pandas as pd
import numpy as np

In [2]:
dataset = pd.read_csv('train.csv')

#Get the Maximum value of the column Age
print('Maximum value of column Age: ', dataset['Age'].max())

Maximum value of column Age:  80.0

In [3]:
#Get the Minimum value of the column Age
print('Minimum value of column Age: ', dataset['Age'].min())

Minimum value of column Age:  0.42

In [4]:
#Find the sum of the rows in the columns Age
print('Sum of the rows in the column Age:', dataset['Age'].sum())

Sum of the rows in the column Age: 21205.17

In [5]:
#Get the count of the number of rows in column Age
print('Count of the no of vlaues in the column Age :', dataset['Age'].count())

Count of the no of vlaues in the column Age : 714

In [6]:
#Get the Average/mean of the column Age
print('The Average age is :', dataset['Age'].mean())

The Average age is : 29.69911764705882

In [9]:
#NaN - Not a Number

#How to find the unique values and its count
print("Age count = ",dataset['Age'].count())

print("\nSex count = ",dataset['Sex'].count())

print("\nSex Unique values = ",dataset['Sex'].unique())

print("\nSex Value counts :\n",dataset['Sex'].value_counts())

Age count =  714

Sex count =  891

Sex Unique values =  ['male' 'female']

Sex Value counts :
 male      577
female    314
Name: Sex, dtype: int64

## Part - 2

In [10]:
Series1 = pd.Series([7,6.8,'Avengers',np.nan,'Apple'])

# isnull() and notnull() functions return Boolean ( True or False)

Series1

0           7
1         6.8
2    Avengers
3         NaN
4       Apple
dtype: object

In [11]:
Series1.isnull().sum()

1

In [12]:
Series1.notnull().sum()

4

In [22]:
dataset = pd.read_csv('train.csv')
dataset['Age'].notnull().sum()

714

In [23]:
dataset[dataset['Age'].notnull()].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
dataset['Sex'].isnull().sum()

0

In [25]:
#What happens if we try to replace some value with nan?
dataset['Sex'] = dataset['Sex'].replace('female',np.nan)
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",NaN,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",NaN,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
dataset['Sex'].isnull().sum()

314

## Part - 3

In [28]:
dataset = pd.read_csv('train.csv')

# 1 Dropping a Single Column of a dataset based on the column name
df1 = dataset.drop('Name',axis=1)
df1.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [29]:

# 2.Dropping multiple Column of a dataset based on the column name

df1 = df1.drop(['Pclass','Cabin'],axis=1)
df1.head()

,PassengerId,Survived,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,female,38.0,1,0,PC 17599,71.2833,C
2,3,1,female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,female,35.0,1,0,113803,53.1000,S
4,5,0,male,35.0,0,0,373450,8.0500,S

In [30]:

# 3. Dropping the Column of a dataset based on the Column Index
df1 = df1.drop(df1.columns[1],axis=1)
df1.head()

   PassengerId     Sex   Age  SibSp  Parch            Ticket     Fare Embarked
0            1    male  22.0      1      0         A/5 21171   7.2500        S
1            2  female  38.0      1      0          PC 17599  71.2833        C
2            3  female  26.0      0      0  STON/O2. 3101282   7.9250        S
3            4  female  35.0      1      0            113803  53.1000        S
4            5    male  35.0      0      0            373450   8.0500        S

In [31]:
# 4. Dropping the Multiple Column of a dataset based on the Column Index
df2 = df1.drop(df1.columns[[1,3]],axis=1)
df2.head()

   PassengerId   Age  Parch            Ticket     Fare Embarked
0            1  22.0      0         A/5 21171   7.2500        S
1            2  38.0      0          PC 17599  71.2833        C
2            3  26.0      0  STON/O2. 3101282   7.9250        S
3            4  35.0      0            113803  53.1000        S
4            5  35.0      0            373450   8.0500        S

In [32]:
# 5. Deleting rows of a dataset and copying the resultant dataset to a new dataframe
df3 = df2.drop(df2.index[[1,3]])
df3.head()

   PassengerId   Age  Parch            Ticket     Fare Embarked
0            1  22.0      0         A/5 21171   7.2500        S
2            3  26.0      0  STON/O2. 3101282   7.9250        S
4            5  35.0      0            373450   8.0500        S
5            6   NaN      0            330877   8.4583        Q
6            7  54.0      0             17463  51.8625        S

In [33]:
# 6. Drop the Duplicate Values based on some conditions
df3 = df3[df3['Embarked'] != 'S'].head()
df3.head()

    PassengerId   Age  Parch  Ticket     Fare Embarked
5             6   NaN      0  330877   8.4583        Q
9            10  14.0      0  237736  30.0708        C
16           17   2.0      1  382652  29.1250        Q
19           20   NaN      0    2649   7.2250        C
22           23  15.0      0  330923   8.0292        Q

In [34]:
dup = df3.drop_duplicates().head()
dup

    PassengerId   Age  Parch  Ticket     Fare Embarked
5             6   NaN      0  330877   8.4583        Q
9            10  14.0      0  237736  30.0708        C
16           17   2.0      1  382652  29.1250        Q
19           20   NaN      0    2649   7.2250        C
22           23  15.0      0  330923   8.0292        Q

In [36]:
dup = dup.drop_duplicates(subset=['Embarked'])
dup

   PassengerId   Age  Parch  Ticket     Fare Embarked
5            6   NaN      0  330877   8.4583        Q
9           10  14.0      0  237736  30.0708        C

In [37]:
dup1 = df3.drop_duplicates(subset=['Embarked'], keep='last')
dup1

    PassengerId   Age  Parch  Ticket    Fare Embarked
19           20   NaN      0    2649  7.2250        C
22           23  15.0      0  330923  8.0292        Q